module.exports = {
	// يمكنك تخصيص اللغة هنا أو مباشرة في ملفات الأوامر بواسطة ShAn
	autoUpdateThreadInfo: {},
	checkwarn: {
		text: {
			warn: "تم تحذير العضو %1 ثلاث مرات سابقاً وتم حظره من صندوق الدردشة\n- الاسم: %1\n- UID: %2\n- لفك الحظر، يرجى استخدام الأمر \"%3warn unban <uid>\" (حيث uid هو معرف الشخص الذي تريد فك حظره)",
			needPermission: "البوت يحتاج إلى صلاحيات المشرف لطرد الأعضاء المحظورين"
		}
	},
	leave: {
		text: {
			session1: "صباحاً",
			session2: "ظهراً",
			session3: "مساءً",
			session4: "مساءً",
			leaveType1: "غادر المجموعة",
			leaveType2: "تم طرده من المجموعة"
		}
	},
	logsbot: {
		text: {
			title: "====== سجلات البوت ======",
			added: "\n✅\nالحدث: تم إضافة البوت إلى مجموعة جديدة\n- تمت الإضافة بواسطة: %1",
			kicked: "\n❌\nالحدث: تم طرد البوت\n- تم الطرد بواسطة: %1",
			footer: "\n- معرف المستخدم: %1\n- المجموعة: %2\n- معرف المجموعة: %3\n- الوقت: %4"
		}
	},
	onEvent: {},
	welcome: {
		text: {
			session1: "صباحاً",
			session2: "ظهراً",
			session3: "مساءً",
			session4: "مساءً",
			welcomeMessage: "شكراً لدعوتي إلى المجموعة!\nبادئة البوت: %1\nلعرض قائمة الأوامر، يرجى إدخال: %1help",
			multiple1: "أنت",
			multiple2: "أنتم"
		}
	}
};
